int n = Convert.ToInt32(Console.ReadLine());
double s = 0;
for (int i = 0; i < n; i++)
{
    double a;
    a = Math.Pow(2,i);
    s += a;
}
System.Console.WriteLine(s);

/*
c# это один из языков программирования. В нынещнее время является одним из самых популярных языков в мире. С ним может
конкурировать С++ python java а так же другие языки. OOP - это один из самых важных критериев сайта на данный момент.
OOP как я думаю, это такая вешь которая помогает нам содержать информацию об людях которые регистрируются на данном сайте.
Class у нас работает как чертеж для постройки дома. class позволяет нам создать один шаблон и использовать его несколько раз.
Например когда мы строим здания, в нем остается неизменным такие вещи как: крыша, стены, фундамент и тд. А вот objects В свою
очередь это уже те вещи которые мы можем коректировать. Например поменять цвет стен и тд.
*/
